Rlesjak/am263_tractionDemo/trinv.syscfg
gpio2.$name                = "CONFIG_GPIO_RES_OTSD";
gpio2.GPIO.gpioPin.$assign = "ball.A15";

gpio3.$name                = "CONFIG_GPIO_nFLT1_H";
gpio3.GPIO.gpioPin.qualSel = "async";
gpio3.GPIO.gpioPin.$assign = "ball.A3";

gpio4.$name                = "CONFIG_GPIO_nFLT1_L";
gpio4.GPIO.gpioPin.qualSel = "async";
gpio4.GPIO.gpioPin.$assign = "ball.B6";

gpio5.$name                = "CONFIG_GPIO_nFLT2_H";
gpio5.GPIO.gpioPin.qualSel = "async";
gpio5.GPIO.gpioPin.$assign = "ball.B5";

gpio6.$name                = "CONFIG_GPIO_nFLT2_L";
gpio6.GPIO.gpioPin.qualSel = "async";
gpio6.GPIO.gpioPin.$assign = "ball.L3";

gpio7.$name                = "CONFIG_GPIO_ASC_EN";
gpio7.pinDir               = "OUTPUT";
gpio7.GPIO.gpioPin.$assign = "ball.K4";

gpio8.$name                = "CONFIG_GPIO_ASC_H";
gpio8.pinDir               = "OUTPUT";
gpio8.GPIO.gpioPin.$assign = "ball.P15";

gpio9.$name                = "CONFIG_GPIO_ASC_L";
gpio9.pinDir               = "OUTPUT";
gpio9.GPIO.gpioPin.$assign = "ball.V17";

gpio10.$name                = "CONFIG_GPIO_VinvA";
gpio10.GPIO.gpioPin.$assign = "ball.A13";
gpio10.GPIO.gpioPin.$used   = false;

gpio11.$name                = "CONFIG_GPIO_VinvB";
gpio11.GPIO.gpioPin.$assign = "ball.B12";
gpio11.GPIO.gpioPin.$used   = false;

gpio12.$name                = "CONFIG_GPIO_VinvC";
gpio12.GPIO.gpioPin.$assign = "ball.D13";

gpio13.$name                = "CONFIG_GPIO_OVP";
gpio13.GPIO.gpioPin.$assign = "ball.E16";

gpio14.$name                = "CONFIG_GPIO_CLR_LATCH";
gpio14.GPIO.gpioPin.$assign = "ball.M16";

gpio15.$name                = "CONFIG_GPIO_OCP_LATCH";
gpio15.GPIO.gpioPin.$assign = "ball.B18";

gpio16.$name                = "CONFIG_GPIO_OVP_LATCH";
gpio16.GPIO.gpioPin.$assign = "ball.H17";

gpio17.$name                = "CONFIG_GPIO_OTP_LATCH";
gpio17.GPIO.gpioPin.$assign = "ball.E17";

gpio18.$name                = "CONFIG_GPIO_GATE_PS_EN";
gpio18.pinDir               = "OUTPUT";
gpio18.GPIO.gpioPin.$assign = "ball.H18";

gpio19.pinDir               = "OUTPUT";
gpio19.$name                = "CONFIG_GPIO_TEST_TOGGLE";
gpio19.GPIO.$assign         = "GPIO0";
gpio19.GPIO.gpioPin.$assign = "ball.C6";

mcspi1.$name                       = "CONFIG_MCSPI_UCC";
mcspi1.intrEnable                  = "POLLED";
mcspi1.SPI.$assign                 = "SPI1";
mcspi1.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].frameFormat = "POL0_PHA1";
mcspi1.mcspiChannel[0].bitRate     = 4000000;

edma1.$name                                      = "CONFIG_EDMA0";
mcspi1.edmaDriver                                = edma1;
edma1.edmaRmDmaCh[0].$name                       = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name                      = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name                         = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name                       = "CONFIG_EDMA_RM3";
edma1.edmaChannel.create(1);
edma1.edmaChannel[0].$name                       = "CONFIG_EDMA_CH0";
edma1.edmaChannel[0].channelTrigger              = "EPWM7_SOCA";
edma1.edmaChannel[0].xbarConfig.$name            = "CONFIG_DMA_TRIG_XBAR0";
edma1.edmaChannel[0].xbarConfig.xbarConfig.$name = "CONFIG_DMA_XBAR0";

uart1.intrEnable       = "DISABLE";
uart1.$name            = "CONFIG_UART_CONSOLE";
uart1.UART.RXD.$assign = "ball.A7";
uart1.UART.TXD.$assign = "ball.A6";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr     = 0x50D00000;
mpu_armv75.size         = 14;
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Device";

mpu_armv76.$name        = "CONFIG_MPU_REGION5";
mpu_armv76.baseAddr     = 0x72000000;
mpu_armv76.size         = 14;
mpu_armv76.allowExecute = false;
mpu_armv76.attributes   = "Device";

mpu_armv77.$name        = "CONFIG_MPU_REGION6";
mpu_armv77.baseAddr     = 0x701D0000;
mpu_armv77.size         = 15;
mpu_armv77.allowExecute = false;
mpu_armv77.attributes   = "Device";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC4_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc2.ADC.AIN2.$suggestSolution              = "ball.T12";
adc3.ADC.AIN0.$suggestSolution              = "ball.R10";
adc3.ADC.AIN2.$suggestSolution              = "ball.U10";
adc4.ADC.$suggestSolution                   = "ADC3";
adc4.ADC.AIN0.$suggestSolution              = "ball.U7";
adc4.ADC.AIN3.$suggestSolution              = "ball.R7";
adc5.ADC.$suggestSolution                   = "ADC0";
adc5.ADC.AIN2.$suggestSolution              = "ball.T14";
adc5.ADC.AIN3.$suggestSolution              = "ball.U14";
epwm2.EPWM.A.$suggestSolution               = "ball.B2";
epwm2.EPWM.B.$suggestSolution               = "ball.B1";
epwm3.EPWM.A.$suggestSolution               = "ball.D3";
epwm3.EPWM.B.$suggestSolution               = "ball.D2";
epwm4.EPWM.$suggestSolution                 = "EPWM2";
epwm4.EPWM.A.$suggestSolution               = "ball.C2";
epwm4.EPWM.B.$suggestSolution               = "ball.C1";
eqep1.EQEP.INDEX.$suggestSolution           = "ball.A12";
gpio1.GPIO.$suggestSolution                 = "GPIO0";
gpio2.GPIO.$suggestSolution                 = "GPIO0";
gpio3.GPIO.$suggestSolution                 = "GPIO0";
gpio4.GPIO.$suggestSolution                 = "GPIO0";
gpio5.GPIO.$suggestSolution                 = "GPIO0";
gpio6.GPIO.$suggestSolution                 = "GPIO0";
gpio7.GPIO.$suggestSolution                 = "GPIO0";
gpio8.GPIO.$suggestSolution                 = "GPIO0";
gpio9.GPIO.$suggestSolution                 = "GPIO0";
gpio10.GPIO.$suggestSolution                = "GPIO0";
gpio11.GPIO.$suggestSolution                = "GPIO0";
gpio12.GPIO.$suggestSolution                = "GPIO0";
gpio13.GPIO.$suggestSolution                = "GPIO0";
gpio14.GPIO.$suggestSolution                = "GPIO0";
gpio15.GPIO.$suggestSolution                = "GPIO0";
gpio16.GPIO.$suggestSolution                = "GPIO0";
gpio17.GPIO.$suggestSolution                = "GPIO0";
gpio18.GPIO.$suggestSolution                = "GPIO0";
mcspi1.SPI.CLK.$suggestSolution             = "ball.A10";
mcspi1.SPI.D0.$suggestSolution              = "ball.B10";
mcspi1.SPI.D1.$suggestSolution              = "ball.D9";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "ball.C9";
uart1.UART.$suggestSolution                 = "UART0";
